wordle.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-02-16 Wed 01:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Wordle</title>
<meta name="author" content="Jb Doyon" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Wordle</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgca4978c">1. Mise en bouche: picking an answer</a>
<ul>
<li><a href="#org217d032">1.1. Solution dictionary file</a></li>
<li><a href="#orgac5fcd0">1.2. TDD for picking word functionality</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Implementing the viral game &ldquo;Wordle&rdquo; in Python using literate programming!
</p>

<p>
Literate programming is the art of writing code as if it was a novel (or
blogpost), writing down what&rsquo;s needed, explaining the reasoning, and weaving in
code snippets that add up to the codebase as we grow in understanding. The
result is a &ldquo;story&rdquo; which can be read, but also &ldquo;tangled&rdquo; back into a proper
codebase that works normally.
</p>

<p>
I&rsquo;ll be making liberal use of Gherkin to describe what we&rsquo;re building.
</p>

<div id="outline-container-orgca4978c" class="outline-2">
<h2 id="orgca4978c"><span class="section-number-2">1.</span> Mise en bouche: picking an answer</h2>
<div class="outline-text-2" id="text-1">
<p>
To get us started, let&rsquo;s cover the very first thing Wordle has to do: pick a
word that will become our answer:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>Our first requirement</label><pre class="src src-feature"><span style="color: #51afef;">Feature:</span><span style="color: #ECBE7B;"> Pick an answer word</span>
  As the wordle game
  I need to pick a random 5 letter word
  In order to let players guess it
</pre>
</div>

<p>
Right. That&rsquo;s fairly straightforward, but the secret word can&rsquo;t be random
characters, it needs to be a proper word. So we need to find a dictionary to
pick from.
</p>
</div>
<div id="outline-container-org217d032" class="outline-3">
<h3 id="org217d032"><span class="section-number-3">1.1.</span> Solution dictionary file</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Since we&rsquo;re trying to match the Wordle website, let&rsquo;s use Wordle&rsquo;s own
dictionary. Someone <a href="https://raw.githubusercontent.com/AllValley/WordleDictionary/main/wordle_solutions_alphabetized.txt">helpfully uploaded it</a>. We&rsquo;ll need to download it locally
first:
</p>

<div class="org-src-container">
<pre class="src src-shell">wget <span style="color: #98be65;">\</span>
    --output-document <span style="color: #98be65;">"src/literate_wordle/wordle_answers_dict.txt"</span> <span style="color: #98be65;">\</span>
    <span style="color: #98be65;">"https://raw.githubusercontent.com/AllValley/WordleDictionary/6f14d2f03d01c36fe66e3ccc0929394251ab139d/wordle_solutions_alphabetized.txt"</span>
</pre>
</div>

<p>
Except an alphabetically sorted text file takes a lot of space but compresses
really well: let&rsquo;s compress that instead
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="color: #dcaeea;">ANSWERS_FILE</span>=<span style="color: #98be65;">"src/literate_wordle/wordle_answers_dict.txt"</span>
<span style="color: #ECBE7B;">ls</span> -hal <span style="color: #98be65;">"</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">{ANSWERS_FILE}</span><span style="color: #98be65;">"</span>
gzip <span style="color: #98be65;">"</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">ANSWERS_FILE</span><span style="color: #98be65;">"</span>
<span style="color: #ECBE7B;">ls</span> -hal <span style="color: #98be65;">"</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">{ANSWERS_FILE}</span><span style="color: #98be65;">.gz"</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">Unnecessary: gzip removes the original as it compresses</span>
<span style="color: #5B6268;"># </span><span style="color: #5B6268;">rm</span><span style="color: #5B6268;"> "$ANSWERS_FILE"</span>
</pre>
</div>

<p>
Sweet, we have cut down by ~two thirds the filesize.
</p>

<p>
Now, let&rsquo;s use Test-Driven Development to guide us towards picking an answer
word.
</p>
</div>
</div>

<div id="outline-container-orgac5fcd0" class="outline-3">
<h3 id="orgac5fcd0"><span class="section-number-3">1.2.</span> TDD for picking word functionality</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #83898d;">"""</span>
<span style="color: #83898d;">Feature: Pick an answer word</span>
<span style="color: #83898d;">  As the wordle game</span>
<span style="color: #83898d;">  I need to pick a random 5 letter word</span>
<span style="color: #83898d;">  In order to let players guess it</span>
<span style="color: #83898d;">"""</span>

<span style="color: #51afef;">from</span> literate_wordle.words <span style="color: #51afef;">import</span> pick_answer_word


<span style="color: #51afef;">def</span> <span style="color: #c678dd;">test_pick_word_ok_length</span><span style="color: #FF8811;">()</span>:
    <span style="color: #83898d;">"""Confirm a wordle solution is of right size"""</span>
    <span style="color: #51afef;">assert</span> <span style="color: #c678dd;">len</span><span style="color: #FF8811;">(</span>pick_answer_word<span style="color: #8F0;">()</span><span style="color: #FF8811;">)</span> == <span style="color: #da8548; font-weight: bold;">5</span>, <span style="color: #98be65;">"Picked wordle solution is wrong size!"</span>
</pre>
</div>

<p>
Of course, since that feature isn&rsquo;t implemented (not even the skeleton), running
tests right now would crash, not just give a red light. So let&rsquo;s implement the
barest hint of a function that returns the wrong thing, to make the test run but
fail:
</p>

<p>
First, the docstring for a new python module <code>words.py</code>
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #83898d;">"""Dictionary features to back wordle solutions"""</span>
</pre>
</div>

<p>
In that module, let&rsquo;s add the skeleton for our <code>pick_answer_word</code> function, but
return an invalid result, to make test explicitly fail:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #51afef;">def</span> <span style="color: #c678dd;">pick_answer_word</span><span style="color: #FF8811;">()</span> -&gt; <span style="color: #c678dd;">str</span>:
    <span style="color: #83898d;">"""Pick a Wordle solution/answer from wordle dictionary"""</span>
    <span style="color: #51afef;">return</span> <span style="color: #98be65;">""</span>  <span style="color: #5B6268;"># </span><span style="color: #5B6268;">Incorrect solution to get RED test</span>
</pre>
</div>

<p>
With our test ready, and a dummy function in place, let&rsquo;s see the tests go red:
</p>


<div class="org-src-container">
<pre class="src src-shell"><span style="color: #ECBE7B;">make</span> test <span style="color: #da8548; font-weight: bold;">2</span>&gt;&amp;<span style="color: #da8548; font-weight: bold;">1</span> || true
</pre>
</div>

<pre class="example" id="org3f322aa">
poetry run pytest
============================= test session starts ==============================
platform linux -- Python 3.9.5, pytest-6.2.5, py-1.11.0, pluggy-1.0.0 -- /home/jiby/dev/ws/short/literate_wordle/.venv/bin/python
cachedir: .pytest_cache
rootdir: /home/jiby/dev/ws/short/literate_wordle, configfile: pyproject.toml
plugins: cov-3.0.0, datadir-1.3.1, clarity-1.0.1
collecting ... collected 2 items

tests/test_pick_word.py::test_pick_word_ok_length FAILED                 [ 50%]
tests/test_version.py::test_version PASSED                               [100%]

=================================== FAILURES ===================================
___________________________ test_pick_word_ok_length ___________________________

    def test_pick_word_ok_length():
        """Confirm a wordle solution is of right size"""
&gt;       assert len(pick_answer_word()) == 5, "Picked wordle solution is wrong size!"
E       AssertionError: Picked wordle solution is wrong size!
E       assert == failed. [pytest-clarity diff shown]
E
E         LHS vs RHS shown below
E
E         0
E         5
E

tests/test_pick_word.py:13: AssertionError
- generated xml file: /home/jiby/dev/ws/short/literate_wordle/test_results/results.xml -
=========================== short test summary info ============================
FAILED tests/test_pick_word.py::test_pick_word_ok_length - AssertionError: Pi...
========================= 1 failed, 1 passed in 0.07s ==========================
make: *** [Makefile:16: test] Error 1
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jb Doyon</p>
<p class="date">Created: 2022-02-16 Wed 01:08</p>
</div>
</body>
</html>
